codeigniter/app/Controllers/User.php

SELECT *
FROM `users`
WHERE `name` = 'ken'
 LIMIT 1
---
    public function verifylogin()
    {

        // Call model
        $userModel = new UserModel();

        // Get data from post form
        $name = $this->request->getPost('name');
        $password = $this->request->getPost('password');

        // Check if user exists in the database
        $data = $userModel->where('name', $name)->first();

SELECT *
FROM `users`
WHERE `users`.`id` = '4'
---
    public function profile()
    {
        // Redirect to login if accessing profile page without logging in
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Get the currently logged-in user's ID
        $userId = session()->get('id');

        // Load the user model
        $userModel = new UserModel();

        // Retrieve the user's data from the database
        $userData = $userModel->find($userId);